DataFrame Alignment
1. Arithmetic Alignment between DataFrames
2. Boolean Alignment between DataFrames
3. Arithmetic Alignment with Series

In [2]:
import pandas as pd

index = ['20201201','20201202','20201203','20201204']
columns = ['AAPL','MSFT','GOOG','AMZN']

data = [[-0.01,0.03,0.05],[0.015,0.005,-0.05,-0.0025],[-0.025,0.0015,-0.02,0.01],[-0.03,0.015,0.03,0.01]]
df1 = pd.DataFrame(data,index = index,columns = columns)
df1

           AAPL    MSFT  GOOG    AMZN
20201201 -0.010  0.0300  0.05     NaN
20201202  0.015  0.0050 -0.05 -0.0025
20201203 -0.025  0.0015 -0.02  0.0100
20201204 -0.030  0.0150  0.03  0.0100

In [5]:
df2 = -1.0*df1
df2

           AAPL    MSFT  GOOG    AMZN
20201201  0.010 -0.0300 -0.05     NaN
20201202 -0.015 -0.0050  0.05  0.0025
20201203  0.025 -0.0015  0.02 -0.0100
20201204  0.030 -0.0150 -0.03 -0.0100

In [4]:
df1+df2

          AAPL  MSFT  GOOG  AMZN
20201201   0.0   0.0   0.0   NaN
20201202   0.0   0.0   0.0   0.0
20201203   0.0   0.0   0.0   0.0
20201204   0.0   0.0   0.0   0.0

In [6]:
#2D list of Numpy array
index=['20201201','20201202','20201203']
columns=['AAPL','MSFT']

data = [[-0.05,0.01],
        [-0.025,0.0075],
        [-0.005,0.015], ]
df3 = pd.DataFrame(data,index = index,columns = columns)
df3

           AAPL    MSFT
20201201 -0.050  0.0100
20201202 -0.025  0.0075
20201203 -0.005  0.0150

In [7]:
df1+df3

          AAPL  AMZN  GOOG    MSFT
20201201 -0.06   NaN   NaN  0.0400
20201202 -0.01   NaN   NaN  0.0125
20201203 -0.03   NaN   NaN  0.0165
20201204   NaN   NaN   NaN     NaN

In [8]:
df1.add(df3, fill_value=0)

          AAPL    AMZN  GOOG    MSFT
20201201 -0.06     NaN  0.05  0.0400
20201202 -0.01 -0.0025 -0.05  0.0125
20201203 -0.03  0.0100 -0.02  0.0165
20201204 -0.03  0.0100  0.03  0.0150

Boolean Alignment

In [9]:
df1>df2

           AAPL  MSFT   GOOG   AMZN
20201201  False  True   True  False
20201202   True  True  False  False
20201203  False  True  False   True
20201204  False  True   True   True

In [10]:
(df1>0) & (df2>0)

           AAPL   MSFT   GOOG   AMZN
20201201  False  False  False  False
20201202  False  False  False  False
20201203  False  False  False  False
20201204  False  False  False  False

Operations b/w a Series and DataFrame are well-defined

In [11]:
df1

           AAPL    MSFT  GOOG    AMZN
20201201 -0.010  0.0300  0.05     NaN
20201202  0.015  0.0050 -0.05 -0.0025
20201203 -0.025  0.0015 -0.02  0.0100
20201204 -0.030  0.0150  0.03  0.0100

In [12]:
#By default arithmetic matches the index of the series on the dataframe's columns
ser = pd.Series({'AAPL':100,'MSFT':200,'GOOG':50})
df1*ser

          AAPL  AMZN  GOOG  MSFT
20201201  -1.0   NaN   2.5   6.0
20201202   1.5   NaN  -2.5   1.0
20201203  -2.5   NaN  -1.0   0.3
20201204  -3.0   NaN   1.5   3.0

In [14]:
ser = pd.Series({'20201201':100,'20201203':200})
df1.mul(ser,axis=0)

          AAPL  MSFT  GOOG  AMZN
20201201  -1.0   3.0   5.0   NaN
20201202   NaN   NaN   NaN   NaN
20201203  -5.0   0.3  -4.0   2.0
20201204   NaN   NaN   NaN   NaN